In [1]:
!cat /etc/os-release

NAME="Ubuntu"
VERSION="20.04.6 LTS (Focal Fossa)"
ID=ubuntu
ID_LIKE=debian
PRETTY_NAME="Ubuntu 20.04.6 LTS"
VERSION_ID="20.04"
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
VERSION_CODENAME=focal
UBUNTU_CODENAME=focal

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from sqlalchemy.engine import create_engine

%matplotlib inline

In [3]:
%load_ext sql
%config SqlMagic.displaylimit=50
%config SqlMagic.autopandas=True

There's a new jupysql version available (0.10.10), you're running 0.10.9. To upgrade: pip install jupysql --upgrade
Deploy Flask apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [4]:
%sql postgresql://imdb:imdb_admin@postgres:5432/imdb_database

Connecting to 'postgresql://imdb:***@postgres:5432/imdb_database'

In [5]:
connection = create_engine('postgresql://imdb:imdb_admin@postgres:5432/imdb_database')

# Introduction to SQL (Structured Query Language)

##### Version 0.1

***

By Scott Coughlin (Northwestern IT Research Computing and Data Services)  
June 4th 2024

[Session 21](https://github.com/LSSTC-DSFP/Session-21) is primarily concerned with handling our data with efficiency.

Ideally, for any and every task we want to desire solutions that operate *faster*.

This can be accomplished many different ways:

$~~~~~~$build algorithms that execute faster

$~~~~~~$spread calculations over many different computers simultaneously

$~~~~~~$find a compact storage solution for the data so it can be accessed more quickly

In our introduction to SQL we will start with simple queries of existing tables, and discuss creating your own tables using `pandas` as a challenge problem.

## Problem 1) IMDb Data

Throughout the session we will use information from the [Internet Movie Database (IMDb)](https://www.imdb.com/) to illustrate various principles regarding databases.

A quick note on the provenance of this data. The files we have used to populate this data set are from [this website](https://relational.fit.cvut.cz/dataset/IMDb) and it may not be a list of every single movie on IMDb (there are no movies after 2004).

#### Please note that you can make an SQL command call from a jupyter cell by adding "%sql" in front of the SQL command you want to run, see examples below
```
## Perform a SQL command and see the results of the query
%sql SELECT * FROM imbd_movies;

## If you save to a variable, in this case "result", then the variable will be a `pandas` DataFrame based on the result of the query
result = %sql SELECT * FROM imdb_directors ORDER BY first_name LIMIT 10; 
```

Please execute the cell below to list all of the table names in the imbd_database database. You will want these table names to answer the questions that follow.

In [6]:
%sql \dt+

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

   Schema                   Name   Type Owner     Size Description
0  public         imdb_directors  table  imdb  4720 kB        None
1  public            imdb_movies  table  imdb    26 MB        None
2  public  imdb_movies_directors  table  imdb    16 MB        None
3  public     imdb_movies_genres  table  imdb    17 MB        None

In [7]:
imdb_movies = %sql SELECT * FROM imdb_movies;
imdb_directors = %sql SELECT * FROM imdb_directors
imdb_movies_directors = %sql SELECT * FROM imdb_movies_directors
imdb_movies_genres = %sql SELECT * FROM imdb_movies_genres

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

355146 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

86880 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

371180 rows affected.

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

395119 rows affected.

**Problem 1a**

Using SQL, SELECT 10 movies from the imbd_movies table. Select 10 directors from imbd_directors and order by `first_name`.

In [14]:
%sql select * from imdb_movies limit 10;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

10 rows affected.

   movie_id                                 name  year  rank
0         0                                  #28  2002   0.0
1         1  #7 Train: An Immigrant Journey, The  2000   0.0
2         2                                    $  1971   6.4
3         3                        $1,000 Reward  1913   0.0
4         4                        $1,000 Reward  1915   0.0
5         5                        $1,000 Reward  1923   0.0
6         6                      $1,000,000 Duck  1971   5.0
7         7               $1,000,000 Reward, The  1920   0.0
8         8               $10,000 Under a Pillow  1921   0.0
9         9                          $100,000.00  1915   0.0

In [20]:
%sql select * from imdb_directors order by first_name limit 10;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

10 rows affected.

   director_id first_name       last_name
0         7494         A.      Bistritsky
1        13355         A.       Champeaux
2         7125         A.       Bhimsingh
3         3728         A.           Babes
4         4871         A.      Barr-Smith
5         8026         A.          Bobrov
6         4175         A.    Balakrishnan
7         6779         A.           Berry
8         1114         A.     Aleksandrov
9        13475         A.  Chandrasekaran

**Problem 1b**

Using SQL, how many movies are there? How many directors are there?

In [34]:
%sql select distinct(*) from imdb_movies_genres;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

RuntimeError: If using snippets, you may pass the --with argument explicitly.
For more details please refer: https://jupysql.ploomber.io/en/latest/compose.html#with-argument


Original error message from DB driver:
(psycopg2.errors.SyntaxError) syntax error at or near "*"
LINE 1: select distinct(*) from imdb_movies_genres;
                        ^

[SQL: select distinct(*) from imdb_movies_genres;]
(Background on this error at: https://sqlalche.me/e/20/f405)

If you need help solving this issue, send us a message: https://ploomber.io/community

In [35]:
%sql select count(*) from imdb_movies

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

    count
0  355146

*Write your answer here*

**Problem 1c**

Using SQL, determine how many movies are there after the year 2000?

In [31]:
%sql select count(*) from imdb_movies as movies where movies.year>2000;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   count
0  39586

*Write your answer here*

**Problem 1d**

How many different movie genres are there?

In [37]:
%sql select count(distinct genre) from imdb_movies_genres;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   count
0     21

*Write your answer here*

## Problem 2) Joins

We started this exercise with a goal of being efficient. And yet, the data have been organized across 4 different files (each sheet is effectively a unique csv file).

**Problem 2a**

Join `imdb_movies` and `imdb_movies_genres` together

In [49]:
%%sql select * 
    from imdb_movies 
    full outer join imdb_movies_genres on imdb_movies.movie_id=imdb_movies_genres.movie_id;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

499123 rows affected.

        movie_id                        name  year  rank  movie_id      genre
0             13      $21 a Day Once a Month  1941   0.0      13.0  Animation
1             13      $21 a Day Once a Month  1941   0.0      13.0      Short
2             18                  $40,000.00  1996   9.6      18.0     Comedy
3             31                       $pent  2000   4.3      31.0      Drama
4             73                  burbs, The  1989   5.9      73.0     Comedy
...          ...                         ...   ...   ...       ...        ...
499118     29637           Barbara (1980/II)  1980   0.0       NaN       None
499119    158841  Inconnue des six jours, L'  1926   0.0       NaN       None
499120    269945        Quinta del porro, La  1980   4.9       NaN       None
499121     50461               Buta no mukui  1999   5.0       NaN       None
499122    205705      Marido provisional, El  1941   0.0       NaN       None

[499123 rows x 6 columns]

*write your answer here*

**Problem 2b**

Join `imdb_movies`, `imdb_movies_directors` and `imdb_directors` together

In [52]:
%sql select * from imdb_directors

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

86880 rows affected.

       director_id first_name    last_name
0                1       Todd            1
1                2        Les  12 Poissons
2                3    Lejaren     a'Hiller
3                4       Nian            A
4                5   Khairiya    A-Mansour
...            ...        ...          ...
86875        88797      Yusuf         Ünal
86876        88798      Ahmet        Ündag
86877        88799       Idil         Üner
86878        88800     Yüksel        Ünsal
86879        88801      Ahmet        Üstel

[86880 rows x 3 columns]

In [54]:
%%sql select * 
    from imdb_movies 
    full outer join imdb_movies_directors on imdb_movies.movie_id=imdb_movies_directors.movie_id
    full outer join imdb_directors on imdb_movies_directors.director_id=imdb_directors.director_id;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

431697 rows affected.

,movie_id,name,year,rank,director_id,movie_id,director_id,first_name,last_name
0,131879.0,Goonda,1984.0,0.0,8.0,131879.0,8.0,Kodanda Rami Reddy,A.
1,179870.0,Kondaveeti Donga,1990.0,0.0,8.0,179870.0,8.0,Kodanda Rami Reddy,A.
2,247163.0,Palnati Simham,1985.0,0.0,8.0,247163.0,8.0,Kodanda Rami Reddy,A.
3,157146.0,Imperial Navy,1981.0,0.0,31.0,157146.0,31.0,Paul,Aaron
4,347746.0,Untamed Love,1994.0,0.0,31.0,347746.0,31.0,Paul,Aaron
...,...,...,...,...,...,...,...,...,...
431692,NaN,None,NaN,NaN,NaN,NaN,61582.0,Arnaud,Pendrié
431693,NaN,None,NaN,NaN,NaN,NaN,55706.0,Carlton,Moss
431694,NaN,None,NaN,NaN,NaN,NaN,4334.0,Michael (I),Ballhaus
431695,NaN,None,NaN,NaN,NaN,NaN,74228.0,Sam,Slam
431696,NaN,None,NaN,NaN,NaN,NaN,32892.0,Jenö,Hartyándi

*write your answer here*

## Problem 3) Groups and Aggregates

Now that we know why the data has been organized in this way, we can leverage this unique structure in order to learn interesting properties of the data.

**Problem 3a**

In which year were the most movies made according to IMDb?

In [57]:
%%sql 
SELECT
  year,
  COUNT(year) AS value_occurrence

FROM
  imdb_movies

GROUP BY 
  year

ORDER BY 
  value_occurrence DESC

LIMIT 10;

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

10 rows affected.

   year  value_occurrence
0  2002             10337
1  2003             10119
2  2000             10107
3  2001             10002
4  1999              9389
5  1998              8636
6  1997              7748
7  2004              7558
8  1996              7275
9  1995              6923

*write your answer here*

**Problem 3b**

How many "Action" movies where made after the year 1980? Before the year 1980?

In [63]:
%%sql
select count(*) from imdb_movies
full outer join imdb_movies_genres on imdb_movies.movie_id=imdb_movies_genres.movie_id
where imdb_movies.year>1980 and imdb_movies_genres.genre='Action';

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   count
0  10135

In [64]:
%%sql
select count(*) from imdb_movies
full outer join imdb_movies_genres on imdb_movies.movie_id=imdb_movies_genres.movie_id
where imdb_movies.year<1980 and imdb_movies_genres.genre='Action';

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   count
0   4090

*write your answer here*

**Problem 3c**

Select all films made by `Scorsese`. How many are there?

In [65]:
%%sql select count(*)
    from imdb_movies 
    full outer join imdb_movies_directors on imdb_movies.movie_id=imdb_movies_directors.movie_id
    full outer join imdb_directors on imdb_movies_directors.director_id=imdb_directors.director_id
    where imdb_directors.last_name='Scorsese';

Running query in 'postgresql://imdb:***@postgres:5432/imdb_database'

1 rows affected.

   count
0     40

*write your answer here*

**Problem 3c**

According the the IMDb data, which director has directed the most movies?

*write your answer here*

**Problem 3d**

According the the IMDb data, which director has directed the most movies in each genre?

*write your answer here*

## Challenge Problem) Make your own tables

**Problem 1a**

Create a new TABLE.

**Problem 1b**

INSERT 3 rows into the TABLE you made above

**Problem 1c**

Create a pandas DataFrame and save as a SQL table

*** hint look at the `pandas.to_sql` documentation and note that we already made a "connection" variable called `connection` ***